#### CADLinkOptions Members

---

|  |
| --- |
| CADLinkOptions Class   Constructors   Methods   Properties   See Also |

The  CADLinkOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | CADLinkOptions(CADLinkOptions) | Constructs a new copy of the input CADLinkOptions object. |
| Public method | CADLinkOptions(Boolean, ElementId) | Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  CADLinkOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PreserveOverrides | Whether Revit should preserve the link's graphic overrides on reload. |
| Public property | ViewId | The id of the view to use as the link's reference view, if the reference view has been deleted. |

# See Also

CADLinkOptions Class

Autodesk.Revit.DB Namespace